src/Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СортироватьПоВозрастанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПриИзмененииЦеныИКоличествоТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПриИзмененииЦеныИКоличествоТовары();
КонецПроцедуры

&НаКлиенте
Функция НовыйСписокДействийПриИзмененииТЧТовары()
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСумму", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Ложь);
	
	Возврат СтруктураДействий;
	
КонецФункции

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	СписокДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦеныИКоличествоТовары()
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСумму", Истина);
	СписокДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуТЧ(СписокДействий)
	
	Если СписокДействий.ЗаполнитьСумму Тогда
		ЗаполнитьСуммуВТЧТовары();
	ИначеЕсли СписокДействий.ЗаполнитьМаксимальноеКоличествоТоваров Тогда
		ЗаполнитьМаксимальноеКоличествоТоваров();
	ИначеЕсли СписокДействий.ЗаполнитьСуммуПоСтавкеНДС Тогда
		ЗаполнитьСуммуПоСтавкеНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуВТЧТовары()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаксимальноеКоличествоТоваров()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Цена) И ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Сумма)Тогда
		ТекущаяСтрока.Количество = Окр(Элементы.Товары.ТекущиеДанные.Сумма/Элементы.Товары.ТекущиеДанные.Цена,0,РежимОкругления.Окр15как10);
		ТекущаяСтрока.Сумма = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если СортироватьПоВозрастанию Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		СортироватьПоВозрастанию = Ложь;
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВнизСерая;
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
		СортироватьПоВозрастанию = Истина;  
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВверхСерая;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуПоСтавкеНДС()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Элементы.Товары.ТекущиеДанные.Сумма, Элементы.Товары.ТекущиеДанные.СтавкаНДС);
	
КонецПроцедуры
